In [1]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [4]:
np.random.seed(3)
df1=pd.DataFrame(np.random.randint(5,size=(4,4))) #기본 정수
df1.iloc[2,3] =np.nan

In [5]:
df1

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [6]:
df1.count()

0    4
1    4
2    4
3    3
dtype: int64

In [8]:
import seaborn as sns # seaborn에서 제공하는 data를 사용하기 위해서 import
# seaborn은 그래프 관련 패키지
titanic = sns.load_dataset('titanic')

titanic.head() #기본 5개 확인

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
# titanic df의  각 열의 원소 개수를 산출 - count() 함수
titanic.shape #(행 , 열) 갯수 반환
titanic.count() # 시리즈 반환
## 위에 2가지를 통해서 각 열의 값의 차기 발생하는 것으로 결측지가 있다는 것을 알 수 있음

(891, 15)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [10]:
np.random.seed(1)
s2=pd.Series(np.random.randint(6,size=100))
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [11]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [12]:

titanic['alive'].value_counts(normalize=True)*100

no     61.616162
yes    38.383838
Name: alive, dtype: float64